{
  "Searching": {
    "description": "OUT NOW On Beatport! Grab your copy here: http://smarturl.it/Damn_BP\n\nSubscribe for more music:\nwww.facebook.com/smashthehouse \nwww.twitter.com/smashthehouse \nwww.youtube.com/SmashTheHouse\n\nWhen it comes to stellar collaborations, it doesn’t get much bigger than this. ‘Damn’ is the work of electro house legend Chuckie and Spanish star Albert Neve, a duo who previously set the scene on fire with their remix of Ambush & DJ Obek’s ‘Craissy’ back in 2012. Their debut original collaboration is more of the same, a devastating electro anthem that is perfectly poised to light up dance floors and raise the roof at venues across the planet. \n\nBuilt around a ‘90s-esque synth riff that dances around the track from the off, where ‘DAMN’ really shines is in how these guys have taken their respective experience, and used it to create something that combines old-school cues with modern electro energy. Both Chuckie and Albert have been part of the dance music scene for a number of years, but their ability to remain ahead of the curve while making subtle nods to their roots is clear to see in ‘Damn’. From the pounding percussion, to the bouncy drops, through to the quirky vocal shouts, ‘Damn’ is also a crowd-friendly anthem that should see it go down a storm in DJ sets, with plenty of support from the big guns already under its belt.",
    "duration": 245,
    "genre": "Electro House",
    "title": "Damn",
    "username": "Smash The House",
    "artist": "Chuckie",
    "remixArtist": null,
    "labelname": "",
    "id": 46710332,
    "isRemix": false,
    "search_stage": 1,
    "url": "https://soundcloud.com/smashthehouse/chuckie-albert-neve-damn"
  },
  "Results": [
    {
      "description": "",
      "duration": 196,
      "genre": "",
      "title": "Lifetyle",
      "username": "Various Artists",
      "artist": "Various Artists",
      "remixArtist": null,
      "labelname": "",
      "id": 762526732,
      "isRemix": false,
      "search_stage": 0,
      "url": "https://www.deezer.com/track/762526732"
    }
  ]
}