{
  "Searching": {
    "description": "Bassjackers - F*CK (Dimitri Vegas & Like Mike Edit) OUT NOW Grab your copy here: http://lnk.to/BassjackersFCK\r\n\r\nDimitri Vegas & Like Mike give their take on Bassjacker’s infamous ‘F*CK’\r\n\r\nSmash The House’s head honcho’s Dimitri Vegas & Like Mike are always prepared to push the boundaries of dance music, and their edit of Bassjacker’s ‘F*CK’ is no exception. Bassjackers are no stranger to creating dancefloor anthems themselves such as “Bring That Beat”, “Marco Polo”, “Rough” and many more. With Dimitri Vegas & Like Mike following on from their Beatport #1 track ‘Melody’ on their own colossal Smash The House imprint, you can guarantee that this combination of two acts in such demand will only result in one outcome; a dancefloor bomb.\r\nThe bouncy bass, glitchy beat and stop-start synth give the track a jacking feel and provide the groove, but it is the cheeky vocal that sets the track apart. The lyrics, from DJ Yoeri’s original ‘Fuck On Cocaine’, released in the midst of rave in 2001, are a throwback to the hedonistic reputation of dance music in years gone by. The growling bassline combines well with the vocal in the breakdown to set an ominous tone, which is switched up later in the track, with an epic ensemble of melodies and harmonies in the latter part creating a memorable contrast. The pounding kick that is introduced in the drop establishes the track as a peak-time, no-frills club banger that is sure to set fire to dancefloors across the world.\r\nBassjackers are a one-of-a-kind DJ-duo, who have made an enormous rise to the top these last years. The numerous collaborations with other artists and even remixes for A-list artists only confirm their status as dancefloor masters.\r\nDimitri Vegas & Like Mike have truly established themselves at the top of the list of the world’s DJ’s. ‘F*CK’ is another track fresh off the relentless production line of dancefloor anthems, and will be heard at festivals and clubs the world over for a long time to come. Get your copy May 23rd via Smash The House!\r\n",
    "duration": 277,
    "genre": "Electro House",
    "title": "F*CK  OUT NOW",
    "username": "Smash The House",
    "artist": "Bassjackers",
    "remixArtist": null,
    "labelname": "",
    "id": 182383245,
    "isRemix": false,
    "search_stage": 1,
    "url": "https://soundcloud.com/smashthehouse/foc"
  },
  "Results": [
    {
      "description": "",
      "duration": 358,
      "genre": "",
      "title": "Stronger",
      "username": "Bassjackers",
      "artist": "Bassjackers",
      "remixArtist": "feat. Bizzey Ralvero",
      "labelname": "",
      "id": 506825852,
      "isRemix": true,
      "search_stage": 0,
      "url": "https://www.deezer.com/track/506825852"
    },
    {
      "description": "",
      "duration": 288,
      "genre": "",
      "title": "Bang Like A",
      "username": "Bassjackers",
      "artist": "Bassjackers",
      "remixArtist": null,
      "labelname": "",
      "id": 506825802,
      "isRemix": false,
      "search_stage": 0,
      "url": "https://www.deezer.com/track/506825802"
    }
  ]
}